# ViewerCropRegionVisible Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewerCropRegionVisible Property
ParameterTypeId Class See Also
---
"Crop Region Visible"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewerCropRegionVisible { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewerCropRegionVisible As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewerCropRegionVisible {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace